In [1]:
#CUSTOMERS active in both May and June
#How did their activity differ between months
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\verus\anaconda3\lib\site-packages (2.0.25)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\verus\anaconda3\lib\site-packages (from sqlalchemy) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\verus\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)

In [2]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\verus\anaconda3\lib\site-packages (1.1.0)

In [3]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine,text 
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [4]:
bd = "Sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/Sakila)

In [5]:
from sqlalchemy import text
with engine.connect() as connection:
    query = text('Select * from rental')
    result = connection.execute(query)
result

In [8]:
with engine.connect() as connection:

    df = pd.read_sql('SELECT * FROM rental',con=connection)
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [9]:
def rentals_month(engine, month=5, year=2005):
    if isinstance(month,(int,float)) and isinstance(year,(int,float)):
        month = int(month)
        year = int(year)
        with engine.connect() as connection:
            query = f'''select * from rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};'''
            rentals_df = pd.read_sql_query(query, con=connection)
        return rentals_df
    else:
        print('Month and year should be numeric')

In [20]:
def rental_count_month(df):
    count_df = df.groupby('customer_id').size().reset_index(name=f'rentals_{month}_{year}')
    return count_df

In [11]:
def compare_rentals(df1, df2):
    merged_df = pd.merge(df1, df2, how='outer').fillna(0)
    merged_df['difference'] = merged_df.iloc[:,2]- merged_df.iloc[:,1]
    return merged_df

In [21]:
rental_count_month(df)

NameError: name 'month' is not defined

In [14]:
may_rentals = rentals_month(engine, 5, 2005)
june_rentals = rentals_month(engine, 6, 2005)
may_counts = rental_count_month(may_rentals, 5, 2005)
june_counts = rental_count_month(june_rentals, 6, 2005)
comparison_df = compare_rentals(may_counts, june_counts, 5, 2005, 6, 2005)
comparison_df

TypeError: rental_count_month() takes 1 positional argument but 3 were given